package Hirukara::AreaLookup;
use strict;
use utf8;

sub __create_shutter_detect   {
    my($area,@numbers) = @_;
    my %nums = map { $_ => 1 } @numbers;

    return sub {
        my($circle) = @_;
        my $num = $circle->circle_num or return;
        $nums{$num} ? "${area}シャッター" : "${area}壁";
    };
}

my %LOOKUP = (
    "×" => "抽選漏れ",
    "Ａ" => __create_shutter_detect("東123", qw/4 5 6 15 16 17 44 45 60 61 72 73 74 83 84 85/),
    "Ｂ" => "東1",
    "Ｃ" => "東1",
    "Ｄ" => "東1",
    "Ｅ" => "東1",
    "Ｆ" => "東1",
    "Ｇ" => "東1",
    "Ｈ" => "東1",
    "Ｉ" => "東1",
    "Ｊ" => "東1",
    "Ｋ" => "東1",
    "Ｌ" => "東1",
    "Ｍ" => "東2",
    "Ｎ" => "東2",
    "Ｏ" => "東2",
    "Ｐ" => "東2",
    "Ｑ" => "東2",
    "Ｒ" => "東2",
    "Ｓ" => "東2",
    "Ｔ" => "東2",
    "Ｕ" => "東2",
    "Ｖ" => "東2",
    "Ｗ" => "東2",
    "Ｘ" => "東2",
    "Ｙ" => "東2",
    "Ｚ" => "東2",
    "ア" => "東3",
    "イ" => "東3",
    "ウ" => "東3",
    "エ" => "東3",
    "オ" => "東3",
    "カ" => "東3",
    "キ" => "東3",
    "ク" => "東3",
    "ケ" => "東3",
    "コ" => "東3",
    "サ" => "東3",
    "シ" => "東456壁",
    "ス" => "東6",
    "セ" => "東6",
    "ソ" => "東6",
    "タ" => "東6",
    "チ" => "東6",
    "ツ" => "東6",
    "テ" => "東6",
    "ト" => "東6",
    "ナ" => "東6",
    "ニ" => "東6",
    "ヌ" => "東6",
    "ネ" => "東5",
    "ノ" => "東5",
    "ハ" => "東5",
    "パ" => "東5",
    "ヒ" => "東5",
    "ピ" => "東5",
    "フ" => "東5",
    "プ" => "東5",
    "ヘ" => "東5",
    "ペ" => "東5",
    "ホ" => "東5",
    "ポ" => "東5",
    "マ" => "東5",
    "ミ" => "東5",
    "ム" => "東4",
    "メ" => "東4",
    "モ" => "東4",
    "ヤ" => "東4",
    "ユ" => "東4",
    "ヨ" => "東4",
    "ラ" => "東4",
    "リ" => "東4",
    "ル" => "東4",
    "レ" => "東4",
    "ロ" => "東4",
    "あ" => __create_shutter_detect("西2", qw/19 20 34 35 43 44 51 52/),
    "い" => "西2",
    "う" => "西2",
    "え" => "西2",
    "お" => "西2",
    "か" => "西2",
    "き" => "西2",
    "く" => "西2",
    "け" => "西2",
    "こ" => "西2",
    "さ" => "西2",
    "し" => "西2",
    "す" => "西2",
    "せ" => "西2",
    "そ" => "西2",
    "た" => "西2",
    "ち" => "西2",
    "つ" => "西2",
    "て" => "西2",
    "と" => "西2",
    "な" => "西2",
    "に" => "西1",
    "ぬ" => "西1",
    "ね" => "西1",
    "の" => "西1",
    "は" => "西1",
    "ひ" => "西1",
    "ふ" => "西1",
    "へ" => "西1",
    "ほ" => "西1",
    "ま" => "西1",
    "み" => "西1",
    "む" => "西1",
    "め" => "西1",
    "も" => "西1",
    "や" => "西1",
    "ゆ" => "西1",
    "よ" => "西1",
    "ら" => "西1",
    "り" => "西1",
    "る" => "西1",
    "れ" => "西1壁",
);

sub lookup  {
    my $circle = shift;
    my $area = $circle->circle_sym;
    my $ret = $LOOKUP{$area};

    return $ret unless ref $ret;
    return $ret->($circle);
}

1;

